{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": {
      "Fixed": 2048
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 30001,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 30000,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 30001,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 30002,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "post_processor": {
    "type": "BertProcessing",
    "sep": [
      "[SEP]",
      30000
    ],
    "cls": [
      "[CLS]",
      30002
    ]
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<unk>": 0,
      "#": 1,
      "%": 2,
      "(": 3,
      ")": 4,
      "*": 5,
      "+": 6,
      "-": 7,
      ".": 8,
      "/": 9,
      "0": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "9": 19,
      ":": 20,
      "=": 21,
      "@": 22,
      "A": 23,
      "B": 24,
      "C": 25,
      "D": 26,
      "E": 27,
      "F": 28,
      "G": 29,
      "H": 30,
      "I": 31,
      "K": 32,
      "L": 33,
      "M": 34,
      "N": 35,
      "O": 36,
      "P": 37,
      "Q": 38,
      "R": 39,
      "S": 40,
      "T": 41,
      "U": 42,
      "V": 43,
      "W": 44,
      "X": 45,
      "Y": 46,
      "Z": 47,
      "[": 48,
      "\\": 49,
      "]": 50,
      "a": 51,
      "b": 52,
      "c": 53,
      "d": 54,
      "e": 55,
      "f": 56,
      "g": 57,
      "h": 58,
      "i": 59,
      "k": 60,
      "l": 61,
      "m": 62,
      "n": 63,
      "o": 64,
      "p": 65,
      "q": 66,
      "r": 67,
      "s": 68,
      "t": 69,
      "u": 70,
      "v": 71,
      "w": 72,
      "y": 73,
      "|": 74,
      "▁": 75,
      "LL": 76,
      "cc": 77,
      "SS": 78,
      "LA": 79,
      "VL": 80,
      "EE": 81,
      "SL": 82,
      "AL": 83,
      "AA": 84,
      "PP": 85,
      "TL": 86,
      "CC": 87,
      "VV": 88,
      "IL": 89,
      "GL": 90,
      "KK": 91,
      "GS": 92,
      "EL": 93,
      "DL": 94,
      "PL": 95,
      "RL": 96,
      "GG": 97,
      "KL": 98,
      "FL": 99,
      "VA": 100,
      "VS": 101,
      "PS": 102,
      "QL": 103,
      "c1": 104,
      "NL": 105,
      "GA": 106,
      "RR": 107,
      "TS": 108,
      "IS": 109,
      "PE": 110,
      "KE": 111,
      "VT": 112,
      "GE": 113,
      "O)": 114,
      "DS": 115,
      "AS": 116,
      "YL": 117,
      "VE": 118,
      "FS": 119,
      "VI": 120,
      "GT": 121,
      "RE": 122,
      "VK": 123,
      "GK": 124,
      "PA": 125,
      "GI": 126,
      "NS": 127,
      "GD": 128,
      "RS": 129,
      "QQ": 130,
      "=O)": 131,
      "VF": 132,
      "II": 133,
      "RD": 134,
      "TA": 135,
      "RK": 136,
      "C(": 137,
      "VD": 138,
      "PD": 139,
      "RA": 140,
      "QE": 141,
      "TE": 142,
      "c(": 143,
      "VN": 144,
      "GN": 145,
      "HL": 146,
      "KS": 147,
      "IA": 148,
      "QA": 149,
      "GF": 150,
      "ML": 151,
      "PT": 152,
      "YS": 153,
      "KA": 154,
      "KD": 155,
      "QS": 156,
      "CL": 157,
      "IF": 158,
      "c2": 159,
      "TT": 160,
      "ED": 161,
      "GR": 162,
      "GP": 163,
      "GY": 164,
      "RN": 165,
      "ID": 166,
      "VP": 167,
      "H]": 168,
      "EA": 169,
      "IT": 170,
      "KN": 171,
      "VY": 172,
      "MA": 173,
      "GQ": 174,
      "RT": 175,
      "HS": 176,
      "VQ": 177,
      "KT": 178,
      "c1cc": 179,
      "PN": 180,
      "PF": 181,
      "DF": 182,
      "IE": 183,
      "[C": 184,
      "[C@": 185,
      "ME": 186,
      "VC": 187,
      "IK": 188,
      "IN": 189,
      "RF": 190,
      "RQ": 191,
      "TF": 192,
      "C(=O)": 193,
      "MS": 194,
      "PQ": 195,
      "C)": 196,
      "RY": 197,
      "IY": 198,
      "VH": 199,
      "CS": 200,
      "ES": 201,
      "DD": 202,
      "IQ": 203,
      "EN": 204,
      "GH": 205,
      "WL": 206,
      "FA": 207,
      "DA": 208,
      "TN": 209,
      "PK": 210,
      "YA": 211,
      "GC": 212,
      "RI": 213,
      "VM": 214,
      "CN": 215,
      "PR": 216,
      "GM": 217,
      "FT": 218,
      "PY": 219,
      "EK": 220,
      "VR": 221,
      "FD": 222,
      "VW": 223,
      "TD": 224,
      "QD": 225,
      "FN": 226,
      "MD": 227,
      "KY": 228,
      "LLL": 229,
      "QN": 230,
      "GV": 231,
      "IP": 232,
      "TK": 233,
      "QK": 234,
      "CA": 235,
      "IM": 236,
      "FF": 237,
      "RH": 238,
      "NN": 239,
      "IC": 240,
      "TP": 241,
      "IH": 242,
      "TY": 243,
      "H](": 244,
      "F)": 245,
      "RP": 246,
      "▁M": 247,
      "FY": 248,
      "WA": 249,
      "1)": 250,
      "HA": 251,
      "NA": 252,
      "YD": 253,
      "PG": 254,
      "VG": 255,
      "c2cc": 256,
      "FE": 257,
      "QY": 258,
      "DE": 259,
      "[C@@": 260,
      "c3": 261,
      "QT": 262,
      "DN": 263,
      "FK": 264,
      "YN": 265,
      "WS": 266,
      "RM": 267,
      "SSS": 268,
      "IV": 269,
      "QH": 270,
      "KH": 271,
      "PH": 272,
      "YT": 273,
      "CT": 274,
      "WE": 275,
      "(C)": 276,
      "LLS": 277,
      "2)": 278,
      "YE": 279,
      "QR": 280,
      "FP": 281,
      "QP": 282,
      "NE": 283,
      "FH": 284,
      "FI": 285,
      "GW": 286,
      "KI": 287,
      "cn": 288,
      "c1ccc(": 289,
      "LLA": 290,
      "NC": 291,
      "HE": 292,
      "MK": 293,
      "(=O)": 294,
      "PV": 295,
      "LAL": 296,
      "▁C": 297,
      "YF": 298,
      "MN": 299,
      "DY": 300,
      "KR": 301,
      "DT": 302,
      "MT": 303,
      "FR": 304,
      "IR": 305,
      "HH": 306,
      "PW": 307,
      "cc(": 308,
      "SSL": 309,
      "DK": 310,
      "1CC": 311,
      "AE": 312,
      "HN": 313,
      "PC": 314,
      "NT": 315,
      "QF": 316,
      "NC(=O)": 317,
      "CE": 318,
      "CD": 319,
      "PI": 320,
      "YY": 321,
      "RG": 322,
      "KQ": 323,
      "SLS": 324,
      "LAA": 325,
      "FQ": 326,
      "N)": 327,
      "[C@H](": 328,
      "RV": 329,
      "NP": 330,
      "TV": 331,
      "RC": 332,
      "ccc1": 333,
      "SA": 334,
      "C(=O)N": 335,
      "VLL": 336,
      "EEL": 337,
      "KG": 338,
      "TQ": 339,
      "FC": 340,
      "TH": 341,
      "TI": 342,
      "NI": 343,
      "▁CC": 344,
      "VLS": 345,
      "NK": 346,
      "TC": 347,
      "GLA": 348,
      "ALS": 349,
      "NY": 350,
      "[C@@H](": 351,
      "ND": 352,
      "RW": 353,
      "QM": 354,
      "KKL": 355,
      "cc1": 356,
      "VLA": 357,
      "YK": 358,
      "QC": 359,
      "GLL": 360,
      "ET": 361,
      "AAA": 362,
      "KM": 363,
      "NLS": 364,
      "DI": 365,
      "GLS": 366,
      "QI": 367,
      "DP": 368,
      "TM": 369,
      "FG": 370,
      "FV": 371,
      "WN": 372,
      "DLS": 373,
      "PM": 374,
      "(CC": 375,
      "EM": 376,
      "CH": 377,
      "EY": 378,
      "EEA": 379,
      "Cl": 380,
      "KP": 381,
      "EQ": 382,
      "GSL": 383,
      "KF": 384,
      "MY": 385,
      "EI": 386,
      "HY": 387,
      "NF": 388,
      "c1n": 389,
      "GSS": 390,
      "LAS": 391,
      "LLD": 392,
      "KLS": 393,
      "ER": 394,
      "[n": 395,
      "VVL": 396,
      "KC": 397,
      "AD": 398,
      "NR": 399,
      "EH": 400,
      "[nH]": 401,
      "n1": 402,
      "Cl)": 403,
      "WY": 404,
      "MF": 405,
      "3)": 406,
      "PPL": 407,
      "KV": 408,
      "HP": 409,
      "CW": 410,
      "QG": 411,
      "IW": 412,
      "HK": 413,
      "VVS": 414,
      "FM": 415,
      "IG": 416,
      "EP": 417,
      "AT": 418,
      "ILS": 419,
      "RDL": 420,
      "AN": 421,
      "AAS": 422,
      "CY": 423,
      "TLS": 424,
      "NH": 425,
      "DG": 426,
      "DC": 427,
      "PLS": 428,
      "c3cc": 429,
      "QV": 430,
      "AF": 431,
      "VAS": 432,
      "[C@@H]": 433,
      "[C@H]": 434,
      "PLL": 435,
      "EG": 436,
      "EC": 437,
      "c1ccccc1": 438,
      "DH": 439,
      "MM": 440,
      "EF": 441,
      "RLL": 442,
      "QW": 443,
      "AV": 444,
      "ccc2": 445,
      "(F)": 446,
      "QLS": 447,
      "EEE": 448,
      "RLS": 449,
      "(C": 450,
      "CI": 451,
      "TR": 452,
      "EES": 453,
      "TG": 454,
      "CK": 455,
      "PPS": 456,
      "HF": 457,
      "DQ": 458,
      "PPA": 459,
      "FLS": 460,
      "FW": 461,
      "YM": 462,
      "CP": 463,
      "▁CO": 464,
      "DR": 465,
      "TW": 466,
      "2CC": 467,
      "VSL": 468,
      "FLL": 469,
      "YI": 470,
      "DM": 471,
      "TLL": 472,
      "VAA": 473,
      "DV": 474,
      "WK": 475,
      "YQ": 476,
      "NG": 477,
      "c2ccc(": 478,
      "NQ": 479,
      "c1)": 480,
      "VVA": 481,
      "SSA": 482,
      "MP": 483,
      "RAL": 484,
      "cc1)": 485,
      "nc(": 486,
      "PEA": 487,
      "KEL": 488,
      "KLL": 489,
      "YP": 490,
      "CF": 491,
      "DLL": 492,
      "HQ": 493,
      "c1cc(": 494,
      "C1": 495,
      "YV": 496,
      "GAA": 497,
      "GGS": 498,
      "GKS": 499,
      "EV": 500,
      "PES": 501,
      "MI": 502,
      "YH": 503,
      "AK": 504,
      "OCC": 505,
      "NM": 506,
      "ILA": 507,
      "ALE": 508,
      "YC": 509,
      "LLN": 510,
      "C(F)": 511,
      "GNL": 512,
      "c4": 513,
      "REL": 514,
      "HT": 515,
      "PSA": 516,
      "▁MA": 517,
      "HC": 518,
      "YG": 519,
      "GGA": 520,
      "HI": 521,
      "RES": 522,
      "VSA": 523,
      "=O": 524,
      "PAS": 525,
      "GES": 526,
      "RAA": 527,
      "TSA": 528,
      "C(C)": 529,
      "CV": 530,
      "PSL": 531,
      "VES": 532,
      "CCCC": 533,
      "QEL": 534,
      "VAL": 535,
      "KKA": 536,
      "ILL": 537,
      "cc2": 538,
      "HD": 539,
      "HR": 540,
      "C(F)(F)": 541,
      "N(CC": 542,
      "ELS": 543,
      "RRA": 544,
      "GSA": 545,
      "VTL": 546,
      "GVL": 547,
      "(=O)(=O)": 548,
      "YR": 549,
      "GDL": 550,
      "WT": 551,
      "PPPP": 552,
      "YLS": 553,
      "RKL": 554,
      "REA": 555,
      "NLL": 556,
      "GAS": 557,
      "ELL": 558,
      "PAL": 559,
      "WH": 560,
      "PEL": 561,
      "RSL": 562,
      "QQQQ": 563,
      "KKS": 564,
      "PSS": 565,
      "VTA": 566,
      "VWS": 567,
      "NV": 568,
      "CG": 569,
      "VLY": 570,
      "c2ccccc2": 571,
      "TSS": 572,
      "RRS": 573,
      "ALD": 574,
      "KES": 575,
      "TES": 576,
      "GVV": 577,
      "LLE": 578,
      "RTL": 579,
      "WD": 580,
      "c1ccc(cc1)": 581,
      "KVL": 582,
      "CM": 583,
      "GEE": 584,
      "WM": 585,
      "MLS": 586,
      "WI": 587,
      "PGS": 588,
      "QLL": 589,
      "RNL": 590,
      "CLS": 591,
      "PVL": 592,
      "WF": 593,
      "HLS": 594,
      "CQ": 595,
      "▁O": 596,
      "GTA": 597,
      "N1CC": 598,
      "c2n": 599,
      "FLK": 600,
      "VEA": 601,
      "TAS": 602,
      "RRL": 603,
      "WC": 604,
      "GEL": 605,
      "MC": 606,
      "VYA": 607,
      "KEA": 608,
      "SSD": 609,
      "VKS": 610,
      "RVL": 611,
      "PEE": 612,
      "c1cccc(": 613,
      "RIL": 614,
      "GEA": 615,
      "PGG": 616,
      "VEL": 617,
      "VGS": 618,
      "LLK": 619,
      "DVL": 620,
      "NGS": 621,
      "SLE": 622,
      "KAL": 623,
      "KTL": 624,
      "NW": 625,
      "▁MS": 626,
      "GVS": 627,
      "IVL": 628,
      "OC": 629,
      "RSS": 630,
      "QPL": 631,
      "VIL": 632,
      "ILE": 633,
      "VAVK": 634,
      "ISL": 635,
      "VSS": 636,
      "RDA": 637,
      "PPE": 638,
      "RKS": 639,
      "HW": 640,
      "KSL": 641,
      "c1cn": 642,
      "ISS": 643,
      "C(O)": 644,
      "1)-": 645,
      "GDS": 646,
      "MQ": 647,
      "PLT": 648,
      "PTL": 649,
      "VFA": 650,
      "GAL": 651,
      "GAF": 652,
      "GIL": 653,
      "ISA": 654,
      "FLA": 655,
      "GLE": 656,
      "GPL": 657,
      "ELE": 658,
      "SSE": 659,
      "RPS": 660,
      "TVL": 661,
      "▁CN": 662,
      "c2c(": 663,
      "CR": 664,
      "EED": 665,
      "▁ME": 666,
      "GPP": 667,
      "QIL": 668,
      "IAL": 669,
      "PGL": 670,
      "PLA": 671,
      "VKE": 672,
      "NLA": 673,
      "C#": 674,
      "DVWS": 675,
      "PGA": 676,
      "DLE": 677,
      "VKK": 678,
      "VGL": 679,
      "VEE": 680,
      "NC(=O)[C@H](": 681,
      "VIA": 682,
      "c2)": 683,
      "NST": 684,
      "VTS": 685,
      "MH": 686,
      "GGGG": 687,
      "PAA": 688,
      "PED": 689,
      "FVV": 690,
      "FSA": 691,
      "RDLAA": 692,
      "IIA": 693,
      "QQL": 694,
      "LLT": 695,
      "VLE": 696,
      "IKK": 697,
      "RDLAARN": 698,
      "REE": 699,
      "(O)": 700,
      "TLK": 701,
      "RGL": 702,
      "KLE": 703,
      "RGS": 704,
      "C(N)": 705,
      "WQ": 706,
      "NSA": 707,
      "GDF": 708,
      "GGL": 709,
      "ILD": 710,
      "FAL": 711,
      "FGS": 712,
      "KKE": 713,
      "VSE": 714,
      "HG": 715,
      "RAS": 716,
      "TAA": 717,
      "YW": 718,
      "VPL": 719,
      "TLA": 720,
      "RYL": 721,
      "VTN": 722,
      "=C": 723,
      "IFS": 724,
      "RPL": 725,
      "▁CC(C)": 726,
      "YSA": 727,
      "[C@H]1": 728,
      "IPL": 729,
      "DW": 730,
      "PSF": 731,
      "GPE": 732,
      "ccc3": 733,
      "TLN": 734,
      "EAE": 735,
      "3CC": 736,
      "VVK": 737,
      "GIA": 738,
      "NLE": 739,
      "PDA": 740,
      "PQQ": 741,
      "KW": 742,
      "NAS": 743,
      "IVK": 744,
      "NLT": 745,
      "[C@@H]1": 746,
      "PGE": 747,
      "C(=O)N[C@@H](": 748,
      "DSS": 749,
      "QRL": 750,
      "FVL": 751,
      "DIL": 752,
      "IPE": 753,
      "GVA": 754,
      "VFS": 755,
      "GTS": 756,
      "PVA": 757,
      "VKL": 758,
      "VDL": 759,
      "IVT": 760,
      "RKA": 761,
      "PVS": 762,
      "TLT": 763,
      "GQL": 764,
      "GVI": 765,
      "FSS": 766,
      "VEN": 767,
      "KDL": 768,
      "GKL": 769,
      "QES": 770,
      "GSF": 771,
      "KKK": 772,
      "ALI": 773,
      "YSS": 774,
      "VLD": 775,
      "DSA": 776,
      "TLE": 777,
      "QAL": 778,
      "RLA": 779,
      "HM": 780,
      "DFGLA": 781,
      "VFL": 782,
      "QAA": 783,
      "RVV": 784,
      "OC)": 785,
      "GRR": 786,
      "QVS": 787,
      "PVD": 788,
      "n2": 789,
      "cc2)": 790,
      "FGV": 791,
      "TEA": 792,
      "RKT": 793,
      "QLE": 794,
      "KDA": 795,
      "KEE": 796,
      "DED": 797,
      "ASA": 798,
      "VQL": 799,
      "PDL": 800,
      "VGA": 801,
      "VRE": 802,
      "PSD": 803,
      "FED": 804,
      "ILT": 805,
      "KLT": 806,
      "GDE": 807,
      "VPE": 808,
      "DYL": 809,
      "SLN": 810,
      "YLA": 811,
      "PTS": 812,
      "RSA": 813,
      "TLQ": 814,
      "PVK": 815,
      "FIL": 816,
      "EEEE": 817,
      "GPS": 818,
      "LAE": 819,
      "LLI": 820,
      "KGL": 821,
      "YLE": 822,
      "TAL": 823,
      "FSL": 824,
      "VPA": 825,
      "VGN": 826,
      "S(=O)(=O)": 827,
      "PVI": 828,
      "GFS": 829,
      "VGE": 830,
      "YLL": 831,
      "CO": 832,
      "CLL": 833,
      "QEA": 834,
      "SLQ": 835,
      "KNL": 836,
      "GDA": 837,
      "VTE": 838,
      "GFA": 839,
      "GKA": 840,
      "PGI": 841,
      "GTL": 842,
      "IPP": 843,
      "IPS": 844,
      "TNS": 845,
      "IAS": 846,
      "GYS": 847,
      "KIL": 848,
      "TSL": 849,
      "GMA": 850,
      "GVT": 851,
      "SSN": 852,
      "PFL": 853,
      "▁MD": 854,
      "QAS": 855,
      "KKT": 856,
      "DSE": 857,
      "GKE": 858,
      "VIS": 859,
      "YLI": 860,
      "c1c(": 861,
      "KSA": 862,
      "PKA": 863,
      "GKK": 864,
      "GIS": 865,
      "PVV": 866,
      "RHL": 867,
      "IIS": 868,
      "PGN": 869,
      "NSL": 870,
      "AAAA": 871,
      "VDA": 872,
      "RRE": 873,
      "RGA": 874,
      "KRK": 875,
      "PLN": 876,
      "RLE": 877,
      "VPS": 878,
      "c1ccccc1)": 879,
      "GVF": 880,
      "RVE": 881,
      "GNS": 882,
      "VLP": 883,
      "MLL": 884,
      "c3ccc(": 885,
      "TIL": 886,
      "NIL": 887,
      "GVD": 888,
      "TEL": 889,
      "TED": 890,
      "TGL": 891,
      "VGG": 892,
      "PIS": 893,
      "RRK": 894,
      "IFL": 895,
      "GVP": 896,
      "EDE": 897,
      "CDL": 898,
      "TVV": 899,
      "IAK": 900,
      "GSN": 901,
      "YLN": 902,
      "c1nc(": 903,
      "FLI": 904,
      "QGL": 905,
      "VNA": 906,
      "MW": 907,
      "RGG": 908,
      "VKA": 909,
      "VSD": 910,
      "QSS": 911,
      "RVA": 912,
      "YVV": 913,
      "GPA": 914,
      "PFF": 915,
      "SLH": 916,
      "PQE": 917,
      "C(F)(F)F)": 918,
      "TSQ": 919,
      "TPL": 920,
      "CLA": 921,
      "C1CC": 922,
      "TEE": 923,
      "VQA": 924,
      "KLY": 925,
      "QQA": 926,
      "QVL": 927,
      "IAA": 928,
      "QSA": 929,
      "TLD": 930,
      "VCS": 931,
      "QVV": 932,
      "NCC": 933,
      "IFA": 934,
      "DPS": 935,
      "RPD": 936,
      "IIY": 937,
      "VSY": 938,
      "VPP": 939,
      "PLE": 940,
      "QIS": 941,
      "GRL": 942,
      "GSE": 943,
      "IGL": 944,
      "VGI": 945,
      "VQE": 946,
      "RAK": 947,
      "GPD": 948,
      "CKE": 949,
      "c2ccccc2)": 950,
      "SLD": 951,
      "c2cc(": 952,
      "KAS": 953,
      "GPT": 954,
      "DVA": 955,
      "VGT": 956,
      "QEE": 957,
      "LLQ": 958,
      "VLN": 959,
      "c(=O)": 960,
      "MAA": 961,
      "QPP": 962,
      "VNL": 963,
      "PGD": 964,
      "PKK": 965,
      "TVS": 966,
      "YTA": 967,
      "FLD": 968,
      "PSE": 969,
      "YVL": 970,
      "FGI": 971,
      "GNA": 972,
      "PDS": 973,
      "RPP": 974,
      "IED": 975,
      "GSC": 976,
      "DGL": 977,
      "MES": 978,
      "QDL": 979,
      "LAN": 980,
      "KIS": 981,
      "DGT": 982,
      "RQL": 983,
      "ILN": 984,
      "C(CC": 985,
      "4)": 986,
      "DPL": 987,
      "ITL": 988,
      "HRD": 989,
      "RHS": 990,
      "QSL": 991,
      "ALY": 992,
      "QLA": 993,
      "VVD": 994,
      "TGT": 995,
      "KDS": 996,
      "GAD": 997,
      "KII": 998,
      "MEL": 999,
      "YTL": 1000,
      "c(n": 1001,
      "GQE": 1002,
      "(C)C)": 1003,
      "VDS": 1004,
      "PQL": 1005,
      "KKD": 1006,
      "LAVA": 1007,
      "NTL": 1008,
      "FSF": 1009,
      "TPP": 1010,
      "EAL": 1011,
      "IEE": 1012,
      "RLD": 1013,
      "RCL": 1014,
      "PVF": 1015,
      "VPD": 1016,
      "IQL": 1017,
      "2)-": 1018,
      "LLC": 1019,
      "PKS": 1020,
      "PVN": 1021,
      "LLLS": 1022,
      "FLH": 1023,
      "PVT": 1024,
      "GYL": 1025,
      "VRA": 1026,
      "PRD": 1027,
      "TTS": 1028,
      "IGG": 1029,
      "KGI": 1030,
      "VIE": 1031,
      "RNA": 1032,
      "VLI": 1033,
      "GLN": 1034,
      "GKY": 1035,
      "AAE": 1036,
      "PIL": 1037,
      "CSS": 1038,
      "GFC": 1039,
      "PAH": 1040,
      "NLQ": 1041,
      "KSS": 1042,
      "GRS": 1043,
      "IES": 1044,
      "YRL": 1045,
      "DFA": 1046,
      "DVWSFGV": 1047,
      "QAE": 1048,
      "TSF": 1049,
      "PGP": 1050,
      "VME": 1051,
      "RPA": 1052,
      "IQE": 1053,
      "RKK": 1054,
      "TRL": 1055,
      "VQQ": 1056,
      "INA": 1057,
      "c3ccccc3": 1058,
      "RML": 1059,
      "PRE": 1060,
      "N(C": 1061,
      "LLLL": 1062,
      "c2c1": 1063,
      "IDL": 1064,
      "IVS": 1065,
      "PPD": 1066,
      "QKL": 1067,
      "FRL": 1068,
      "VGP": 1069,
      "VHA": 1070,
      "FSH": 1071,
      "GSY": 1072,
      "KPS": 1073,
      "KQL": 1074,
      "PGF": 1075,
      "RTS": 1076,
      "MEE": 1077,
      "CWL": 1078,
      "GIN": 1079,
      "FII": 1080,
      "RKN": 1081,
      "CC1": 1082,
      "\\C": 1083,
      "PKL": 1084,
      "RGR": 1085,
      "PRS": 1086,
      "NTT": 1087,
      "VGD": 1088,
      "VYL": 1089,
      "VRR": 1090,
      "LAT": 1091,
      "CCS": 1092,
      "VYS": 1093,
      "ETS": 1094,
      "C1)": 1095,
      "TAE": 1096,
      "WW": 1097,
      "GVN": 1098,
      "KPE": 1099,
      "VQS": 1100,
      "IIL": 1101,
      "RPE": 1102,
      "KIA": 1103,
      "IKS": 1104,
      "QLF": 1105,
      "MAPE": 1106,
      "VLK": 1107,
      "HSS": 1108,
      "DSK": 1109,
      "PDE": 1110,
      "PKE": 1111,
      "KDE": 1112,
      "VRL": 1113,
      "QRR": 1114,
      "QRE": 1115,
      "QVT": 1116,
      "GFL": 1117,
      "FKD": 1118,
      "QTL": 1119,
      "TDL": 1120,
      "ELM": 1121,
      "GTE": 1122,
      "KEK": 1123,
      "IKA": 1124,
      "RIA": 1125,
      "CVV": 1126,
      "DAL": 1127,
      "C(O)=O)": 1128,
      "c1ccc2": 1129,
      "QVE": 1130,
      "VLH": 1131,
      "c3)": 1132,
      "GRD": 1133,
      "IKL": 1134,
      "VML": 1135,
      "VRS": 1136,
      "NKT": 1137,
      "IIE": 1138,
      "C#N)": 1139,
      "C[C@H](": 1140,
      "DLD": 1141,
      "PGQ": 1142,
      "VAE": 1143,
      "LLH": 1144,
      "YGL": 1145,
      "GVC": 1146,
      "FRR": 1147,
      "GVE": 1148,
      "DLA": 1149,
      "▁N": 1150,
      "PLH": 1151,
      "TVK": 1152,
      "KLA": 1153,
      "cc3": 1154,
      "GKT": 1155,
      "RKC": 1156,
      "GVQ": 1157,
      "TKA": 1158,
      "TDS": 1159,
      "VIY": 1160,
      "RQE": 1161,
      "QLN": 1162,
      "KNA": 1163,
      "ESA": 1164,
      "YEE": 1165,
      "KKN": 1166,
      "FFL": 1167,
      "TPY": 1168,
      "GAE": 1169,
      "VDRY": 1170,
      "IKD": 1171,
      "▁F": 1172,
      "KVK": 1173,
      "TGI": 1174,
      "ISD": 1175,
      "VVE": 1176,
      "GCL": 1177,
      "QPS": 1178,
      "nc1": 1179,
      "PQA": 1180,
      "KSE": 1181,
      "VHRDLAARN": 1182,
      "[C@]": 1183,
      "GGN": 1184,
      "RVI": 1185,
      "HSA": 1186,
      "IPA": 1187,
      "VRQ": 1188,
      "ITE": 1189,
      "VRD": 1190,
      "CVL": 1191,
      "VEK": 1192,
      "RKE": 1193,
      "FGK": 1194,
      "RQS": 1195,
      "VDE": 1196,
      "HLH": 1197,
      "GRA": 1198,
      "TFS": 1199,
      "GVY": 1200,
      "GCA": 1201,
      "TTL": 1202,
      "RFA": 1203,
      "RAY": 1204,
      "c1)-": 1205,
      "KNC": 1206,
      "VFH": 1207,
      "KVI": 1208,
      "IRN": 1209,
      "FLN": 1210,
      "GLD": 1211,
      "c[nH]": 1212,
      "RVT": 1213,
      "c4cc": 1214,
      "PAE": 1215,
      "VGR": 1216,
      "GVK": 1217,
      "LAF": 1218,
      "IDY": 1219,
      "TSE": 1220,
      "GKM": 1221,
      "KLN": 1222,
      "TGS": 1223,
      "GNVL": 1224,
      "SLK": 1225,
      "IVD": 1226,
      "GHA": 1227,
      "FGG": 1228,
      "PEN": 1229,
      "QSF": 1230,
      "IPT": 1231,
      "QKK": 1232,
      "IDRY": 1233,
      "N(CC1)": 1234,
      "RFL": 1235,
      "RVF": 1236,
      "RIS": 1237,
      "DPT": 1238,
      "SSH": 1239,
      "GYA": 1240,
      "YAL": 1241,
      "GSD": 1242,
      "IRQ": 1243,
      "C2": 1244,
      "ISF": 1245,
      "QGQ": 1246,
      "QKS": 1247,
      "VGF": 1248,
      "KPL": 1249,
      "VLM": 1250,
      "VAY": 1251,
      "TAD": 1252,
      "RGE": 1253,
      "VNS": 1254,
      "VRT": 1255,
      "FKL": 1256,
      "ELN": 1257,
      "IVA": 1258,
      "DVS": 1259,
      "SSSS": 1260,
      "FAS": 1261,
      "RFS": 1262,
      "DML": 1263,
      "WSL": 1264,
      "LAH": 1265,
      "IKE": 1266,
      "RDS": 1267,
      "GQA": 1268,
      "GHS": 1269,
      "TEN": 1270,
      "TFL": 1271,
      "WPF": 1272,
      "RGD": 1273,
      "HGP": 1274,
      "PNA": 1275,
      "[C@@]": 1276,
      "KFD": 1277,
      "PKD": 1278,
      "VRN": 1279,
      "PEK": 1280,
      "TPQ": 1281,
      "TVT": 1282,
      "VGC": 1283,
      "PGK": 1284,
      "IQS": 1285,
      "TVF": 1286,
      "(=O)N": 1287,
      "KEY": 1288,
      "IDA": 1289,
      "PIF": 1290,
      "IGE": 1291,
      "PEY": 1292,
      "HLE": 1293,
      "=C(": 1294,
      "ILK": 1295,
      "PKT": 1296,
      "VEY": 1297,
      "PDY": 1298,
      "HRL": 1299,
      "TSN": 1300,
      "KGK": 1301,
      "NSK": 1302,
      "RVP": 1303,
      "RGT": 1304,
      "VRY": 1305,
      "VFE": 1306,
      "c1ccc(cc1)-": 1307,
      "QGG": 1308,
      "QYL": 1309,
      "PGT": 1310,
      "ESL": 1311,
      "VPT": 1312,
      "LAI": 1313,
      "RNS": 1314,
      "MLD": 1315,
      "PECL": 1316,
      "RVD": 1317,
      "\\C=C": 1318,
      "IRE": 1319,
      "TGE": 1320,
      "PRR": 1321,
      "TVH": 1322,
      "c(F)": 1323,
      "PRA": 1324,
      "NEE": 1325,
      "CCCN": 1326,
      "c1cc2": 1327,
      "RIY": 1328,
      "TPS": 1329,
      "PYL": 1330,
      "FGE": 1331,
      "YVA": 1332,
      "MLN": 1333,
      "TVD": 1334,
      "KRR": 1335,
      "YSL": 1336,
      "MVD": 1337,
      "QPQ": 1338,
      "ITT": 1339,
      "WYA": 1340,
      "IRD": 1341,
      "TVP": 1342,
      "TGD": 1343,
      "DGK": 1344,
      "FTL": 1345,
      "ASE": 1346,
      "QGK": 1347,
      "GRE": 1348,
      "NLD": 1349,
      "PRL": 1350,
      "FGA": 1351,
      "VLC": 1352,
      "VRK": 1353,
      "IVI": 1354,
      "VAN": 1355,
      "CRF": 1356,
      "IGD": 1357,
      "FRE": 1358,
      "C(F)(F)F": 1359,
      "VND": 1360,
      "N(C)": 1361,
      "DTL": 1362,
      "FRD": 1363,
      "KIC": 1364,
      "RVK": 1365,
      "YFL": 1366,
      "FGT": 1367,
      "RQQ": 1368,
      "DDE": 1369,
      "MLA": 1370,
      "IQN": 1371,
      "GRY": 1372,
      "RPH": 1373,
      "DVT": 1374,
      "RGQ": 1375,
      "KHL": 1376,
      "IGA": 1377,
      "IPN": 1378,
      "IDS": 1379,
      "TVA": 1380,
      "KVT": 1381,
      "RPT": 1382,
      "FVS": 1383,
      "PFS": 1384,
      "ELY": 1385,
      "MAL": 1386,
      "IDH": 1387,
      "GGE": 1388,
      "GQS": 1389,
      "WKA": 1390,
      "C(=O)N1CC": 1391,
      "VMA": 1392,
      "RCS": 1393,
      "NYL": 1394,
      "KLI": 1395,
      "RIH": 1396,
      "N2CC": 1397,
      "c2cn": 1398,
      "VLLL": 1399,
      "RIF": 1400,
      "YLD": 1401,
      "EEK": 1402,
      "PQS": 1403,
      "C(=O)NC": 1404,
      "PGR": 1405,
      "RGN": 1406,
      "VVC": 1407,
      "QED": 1408,
      "KVN": 1409,
      "QPE": 1410,
      "ELH": 1411,
      "IRS": 1412,
      "cnc1": 1413,
      "PQD": 1414,
      "FVK": 1415,
      "RII": 1416,
      "ICS": 1417,
      "VCA": 1418,
      "FQS": 1419,
      "+]": 1420,
      "NSS": 1421,
      "VVAL": 1422,
      "C2)": 1423,
      "VVN": 1424,
      "PYD": 1425,
      "TKL": 1426,
      "ITS": 1427,
      "VNN": 1428,
      "LLF": 1429,
      "IVV": 1430,
      "RSE": 1431,
      "KGF": 1432,
      "VLQ": 1433,
      "MSA": 1434,
      "KRF": 1435,
      "GYE": 1436,
      "RLH": 1437,
      "MEYL": 1438,
      "TKK": 1439,
      "IIN": 1440,
      "GLY": 1441,
      "PVP": 1442,
      "GQQ": 1443,
      "YAA": 1444,
      "HLL": 1445,
      "VFD": 1446,
      "ALC": 1447,
      "c(C)": 1448,
      "YSN": 1449,
      "LALA": 1450,
      "YVK": 1451,
      "PIT": 1452,
      "c1ccc(Cl)": 1453,
      "NFA": 1454,
      "YKD": 1455,
      "c(Cl)": 1456,
      "-]": 1457,
      "PID": 1458,
      "CNC(=O)": 1459,
      "PTA": 1460,
      "INS": 1461,
      "IEN": 1462,
      "NS(=O)(=O)": 1463,
      "QGE": 1464,
      "RVY": 1465,
      "YKE": 1466,
      "DSD": 1467,
      "SSLS": 1468,
      "PLM": 1469,
      "TQL": 1470,
      "MGL": 1471,
      "VLGI": 1472,
      "RDE": 1473,
      "CCL": 1474,
      "NTS": 1475,
      "NLY": 1476,
      "KEM": 1477,
      "FTK": 1478,
      "TFA": 1479,
      "IRR": 1480,
      "GRK": 1481,
      "ILH": 1482,
      "IKN": 1483,
      "YTS": 1484,
      "IEF": 1485,
      "KED": 1486,
      "PSK": 1487,
      "nn": 1488,
      "VGK": 1489,
      "EDA": 1490,
      "c2ccccc1": 1491,
      "NVA": 1492,
      "NIT": 1493,
      "SSF": 1494,
      "CRL": 1495,
      "ETA": 1496,
      "c1ccc(F)": 1497,
      "KKF": 1498,
      "RRRR": 1499,
      "RVS": 1500,
      "NVL": 1501,
      "RYS": 1502,
      "TFH": 1503,
      "Br": 1504,
      "RGI": 1505,
      "VCL": 1506,
      "DPA": 1507,
      "TDF": 1508,
      "YGT": 1509,
      "HVK": 1510,
      "ALH": 1511,
      "GMS": 1512,
      "IHS": 1513,
      "FVI": 1514,
      "DAE": 1515,
      "ELQ": 1516,
      "DDL": 1517,
      "FLQ": 1518,
      "CSA": 1519,
      "CO)": 1520,
      "RGY": 1521,
      "DIA": 1522,
      "TPT": 1523,
      "ICL": 1524,
      "PNS": 1525,
      "IGN": 1526,
      "DGS": 1527,
      "MAS": 1528,
      "c(N": 1529,
      "RLQ": 1530,
      "QGP": 1531,
      "ITA": 1532,
      "FKK": 1533,
      "DFGLS": 1534,
      "RGP": 1535,
      "LLLLL": 1536,
      "RQA": 1537,
      "DPD": 1538,
      "GVW": 1539,
      "PVQ": 1540,
      "GCS": 1541,
      "TPA": 1542,
      "QKE": 1543,
      "VMM": 1544,
      "HAL": 1545,
      "TDD": 1546,
      "GRN": 1547,
      "FTF": 1548,
      "ccn": 1549,
      "C(O)=O": 1550,
      "KGA": 1551,
      "CVE": 1552,
      "KEKD": 1553,
      "CVS": 1554,
      "NGG": 1555,
      "VRF": 1556,
      "FLF": 1557,
      "TPE": 1558,
      "QGM": 1559,
      "LLWE": 1560,
      "MVS": 1561,
      "EDL": 1562,
      "NSE": 1563,
      "RPR": 1564,
      "IYS": 1565,
      "PLPP": 1566,
      "IYA": 1567,
      "QQS": 1568,
      "FLE": 1569,
      "KET": 1570,
      "[C@H]1CC": 1571,
      "=N)": 1572,
      "VAIK": 1573,
      "DPE": 1574,
      "TNA": 1575,
      "IGDF": 1576,
      "FFA": 1577,
      "TST": 1578,
      "HHL": 1579,
      "IPD": 1580,
      "PMD": 1581,
      "YRA": 1582,
      "QSE": 1583,
      "LLSL": 1584,
      "KLK": 1585,
      "CPA": 1586,
      "DFS": 1587,
      "FGH": 1588,
      "RAE": 1589,
      "FYL": 1590,
      "RGK": 1591,
      "QID": 1592,
      "KDN": 1593,
      "FPA": 1594,
      "TGN": 1595,
      "TVN": 1596,
      "CAA": 1597,
      "VAVL": 1598,
      "VAVKML": 1599,
      "KIN": 1600,
      "(N)": 1601,
      "QLM": 1602,
      "DVE": 1603,
      "FFE": 1604,
      "KGR": 1605,
      "DKD": 1606,
      "HPN": 1607,
      "YRE": 1608,
      "KYA": 1609,
      "FSE": 1610,
      "QCL": 1611,
      "PKN": 1612,
      "INKL": 1613,
      "EEN": 1614,
      "N1": 1615,
      "IEL": 1616,
      "CTL": 1617,
      "c2cccc(": 1618,
      "DKA": 1619,
      "CGE": 1620,
      "IHRD": 1621,
      "VSW": 1622,
      "CGS": 1623,
      "NIS": 1624,
      "[C@H]2": 1625,
      "QRP": 1626,
      "DVV": 1627,
      "TIK": 1628,
      "IAT": 1629,
      "WTL": 1630,
      "KPA": 1631,
      "RRH": 1632,
      "GGK": 1633,
      "RSY": 1634,
      "FPL": 1635,
      "QFL": 1636,
      "QGR": 1637,
      "PRT": 1638,
      "SSQ": 1639,
      "RTT": 1640,
      "IPF": 1641,
      "FVE": 1642,
      "ILRL": 1643,
      "PII": 1644,
      "[C@@H]1CC": 1645,
      "KYL": 1646,
      "CGT": 1647,
      "ESE": 1648,
      "RGF": 1649,
      "QPA": 1650,
      "TGY": 1651,
      "YPL": 1652,
      "SLM": 1653,
      "RTA": 1654,
      "SSY": 1655,
      "IGH": 1656,
      "IKT": 1657,
      "[O": 1658,
      "VYE": 1659,
      "ALN": 1660,
      "QNS": 1661,
      "TTE": 1662,
      "VGQ": 1663,
      "GAH": 1664,
      "VRH": 1665,
      "CEA": 1666,
      "FKN": 1667,
      "RIQ": 1668,
      "QGD": 1669,
      "YKL": 1670,
      "IVN": 1671,
      "[C@@H](C)": 1672,
      "C(C)(C)": 1673,
      "EDN": 1674,
      "MAE": 1675,
      "cs": 1676,
      "KRA": 1677,
      "[O-]": 1678,
      "RYA": 1679,
      "NCS": 1680,
      "LLKT": 1681,
      "HRN": 1682,
      "C(C)C)": 1683,
      "TID": 1684,
      "cc3)": 1685,
      "YDL": 1686,
      "KAE": 1687,
      "RMD": 1688,
      "FPQ": 1689,
      "QML": 1690,
      "TVE": 1691,
      "QQN": 1692,
      "QYS": 1693,
      "VRI": 1694,
      "IIM": 1695,
      "IQQ": 1696,
      "YGK": 1697,
      "HLN": 1698,
      "KML": 1699,
      "DAA": 1700,
      "VPH": 1701,
      "VMS": 1702,
      "QGS": 1703,
      "FIS": 1704,
      "CQA": 1705,
      "INN": 1706,
      "TVC": 1707,
      "FGL": 1708,
      "WTY": 1709,
      "YEL": 1710,
      "TIS": 1711,
      "KQE": 1712,
      "YLY": 1713,
      "TRS": 1714,
      "QIA": 1715,
      "IMS": 1716,
      "TGA": 1717,
      "VSAL": 1718,
      "DVF": 1719,
      "IGS": 1720,
      "NVT": 1721,
      "HPE": 1722,
      "HPS": 1723,
      "KGE": 1724,
      "FTA": 1725,
      "IGT": 1726,
      "LAW": 1727,
      "TSM": 1728,
      "PGC": 1729,
      "n(": 1730,
      "QTA": 1731,
      "DSL": 1732,
      "FTT": 1733,
      "ISE": 1734,
      "FRQ": 1735,
      "TGK": 1736,
      "TGP": 1737,
      "NLN": 1738,
      "CVA": 1739,
      "(O)=O)": 1740,
      "PVC": 1741,
      "RLY": 1742,
      "IVE": 1743,
      "PPQ": 1744,
      "QGT": 1745,
      "CGI": 1746,
      "[C@H](O)": 1747,
      "QHS": 1748,
      "CLM": 1749,
      "VID": 1750,
      "NPN": 1751,
      "IFTL": 1752,
      "PNL": 1753,
      "RGC": 1754,
      "VLEN": 1755,
      "WAA": 1756,
      "FAA": 1757,
      "NEL": 1758,
      "PML": 1759,
      "[C@@H](O)": 1760,
      "RWL": 1761,
      "CRK": 1762,
      "FQN": 1763,
      "DEL": 1764,
      "IRL": 1765,
      "KIK": 1766,
      "IFK": 1767,
      "[N": 1768,
      "FQE": 1769,
      "KIY": 1770,
      "LLSA": 1771,
      "CWA": 1772,
      "LLY": 1773,
      "SLW": 1774,
      "IEA": 1775,
      "YLM": 1776,
      "CN(C": 1777,
      "IVF": 1778,
      "(=O)=O)": 1779,
      "HHHH": 1780,
      "GDDL": 1781,
      "HPL": 1782,
      "YGS": 1783,
      "KEN": 1784,
      "QVA": 1785,
      "RPF": 1786,
      "FLC": 1787,
      "TQE": 1788,
      "FRA": 1789,
      "NGT": 1790,
      "IVC": 1791,
      "NFN": 1792,
      "Br)": 1793,
      "FYS": 1794,
      "PVE": 1795,
      "GFY": 1796,
      "NGA": 1797,
      "PVY": 1798,
      "DSGG": 1799,
      "RIT": 1800,
      "IEIL": 1801,
      "WVL": 1802,
      "QDA": 1803,
      "FRS": 1804,
      "IVTL": 1805,
      "GHL": 1806,
      "KAA": 1807,
      "VPY": 1808,
      "KQK": 1809,
      "VKAL": 1810,
      "IHRDLAARN": 1811,
      "TGG": 1812,
      "PHS": 1813,
      "DGG": 1814,
      "QRA": 1815,
      "RNY": 1816,
      "HAE": 1817,
      "c2ccc(cc2)": 1818,
      "TVQ": 1819,
      "QRQ": 1820,
      "FNL": 1821,
      "VLVV": 1822,
      "FGVV": 1823,
      "YLH": 1824,
      "CPP": 1825,
      "VKW": 1826,
      "RFY": 1827,
      "WEL": 1828,
      "VGY": 1829,
      "TSIS": 1830,
      "IPQ": 1831,
      "MRT": 1832,
      "NSN": 1833,
      "TPD": 1834,
      "c3n": 1835,
      "QKD": 1836,
      "\\C=C\\": 1837,
      "GML": 1838,
      "SSSE": 1839,
      "TKT": 1840,
      "CGA": 1841,
      "FRK": 1842,
      "IRK": 1843,
      "KGS": 1844,
      "FVT": 1845,
      "TKD": 1846,
      "TNL": 1847,
      "FTS": 1848,
      "DRL": 1849,
      "EEY": 1850,
      "QNA": 1851,
      "VGM": 1852,
      "FGQ": 1853,
      "LLLA": 1854,
      "KTT": 1855,
      "[C@@H]2": 1856,
      "FPS": 1857,
      "IVR": 1858,
      "PTH": 1859,
      "KFS": 1860,
      "YGD": 1861,
      "VWL": 1862,
      "c2nc(": 1863,
      "ISY": 1864,
      "CKA": 1865,
      "NPA": 1866,
      "NVN": 1867,
      "NAL": 1868,
      "IVH": 1869,
      "TGR": 1870,
      "NSM": 1871,
      "KKC": 1872,
      "DRY": 1873,
      "GVM": 1874,
      "GSK": 1875,
      "TCS": 1876,
      "YSE": 1877,
      "VAT": 1878,
      "HAA": 1879,
      "QGF": 1880,
      "QQQQQQQQ": 1881,
      "WTA": 1882,
      "VMD": 1883,
      "VHH": 1884,
      "HGL": 1885,
      "VIM": 1886,
      "LLGA": 1887,
      "CQF": 1888,
      "▁Cl": 1889,
      "GLSL": 1890,
      "VKEE": 1891,
      "ENN": 1892,
      "PGES": 1893,
      "TIA": 1894,
      "MTF": 1895,
      "GNE": 1896,
      "QNL": 1897,
      "TTA": 1898,
      "DSVT": 1899,
      "▁CCO": 1900,
      "KVS": 1901,
      "VVM": 1902,
      "PSC": 1903,
      "MKH": 1904,
      "RSLL": 1905,
      "PGM": 1906,
      "MRR": 1907,
      "MSL": 1908,
      "DGA": 1909,
      "c5": 1910,
      "HSL": 1911,
      "▁OC(=O)": 1912,
      "TYL": 1913,
      "GEN": 1914,
      "VSVS": 1915,
      "GIE": 1916,
      "QIT": 1917,
      "PSM": 1918,
      "IRF": 1919,
      "ITH": 1920,
      "C#N": 1921,
      "KFP": 1922,
      "CAGY": 1923,
      "VGAL": 1924,
      "VAM": 1925,
      "PFA": 1926,
      "IGP": 1927,
      "NPL": 1928,
      "RMS": 1929,
      "c12": 1930,
      "MDL": 1931,
      "HLA": 1932,
      "TIT": 1933,
      "HEL": 1934,
      "NC(=O)[C@@H](": 1935,
      "IVQ": 1936,
      "CEGC": 1937,
      "HVD": 1938,
      "FDH": 1939,
      "QKA": 1940,
      "PRF": 1941,
      "CVD": 1942,
      "c3ccccc3)": 1943,
      "TRD": 1944,
      "CEE": 1945,
      "KRS": 1946,
      "RVN": 1947,
      "QII": 1948,
      "PDK": 1949,
      "RMA": 1950,
      "DGE": 1951,
      "=N": 1952,
      "ENA": 1953,
      "INL": 1954,
      "TEY": 1955,
      "CGL": 1956,
      "LLAA": 1957,
      "PIQ": 1958,
      "ILLS": 1959,
      "PHL": 1960,
      "WLA": 1961,
      "VNH": 1962,
      "ELA": 1963,
      "QLD": 1964,
      "CCC": 1965,
      "RPN": 1966,
      "YIS": 1967,
      "RVC": 1968,
      "IAE": 1969,
      "WMAPE": 1970,
      "MSE": 1971,
      "CAS": 1972,
      "▁COc1ccc(": 1973,
      "VGV": 1974,
      "KVV": 1975,
      "VHS": 1976,
      "CKD": 1977,
      "CC1)": 1978,
      "QDS": 1979,
      "TIQ": 1980,
      "TVR": 1981,
      "DLM": 1982,
      "RSD": 1983,
      "n1cc(": 1984,
      "GTK": 1985,
      "IVY": 1986,
      "WAL": 1987,
      "PIIY": 1988,
      "GEGE": 1989,
      "TIH": 1990,
      "[N+]": 1991,
      "FVN": 1992,
      "RRN": 1993,
      "CFT": 1994,
      "WSA": 1995,
      "YID": 1996,
      "RIK": 1997,
      "DPN": 1998,
      "ILNL": 1999,
      "FEL": 2000,
      "IYL": 2001,
      "MRL": 2002,
      "TKS": 2003,
      "FPK": 2004,
      "RIPW": 2005,
      "MEM": 2006,
      "KDH": 2007,
      "NC(=O)[C@H](C": 2008,
      "YED": 2009,
      "TSD": 2010,
      "[O-])": 2011,
      "GGF": 2012,
      "IMA": 2013,
      "CIS": 2014,
      "CGN": 2015,
      "DLK": 2016,
      "TPF": 2017,
      "▁COc1cc(": 2018,
      "KLM": 2019,
      "KGT": 2020,
      "WEFP": 2021,
      "IHL": 2022,
      "IML": 2023,
      "GALA": 2024,
      "C2CC": 2025,
      "WDC": 2026,
      "SSAS": 2027,
      "[C@H](C)": 2028,
      "LALS": 2029,
      "RNIL": 2030,
      "CC2)": 2031,
      "NC(=O)[C@H](CC": 2032,
      "QIF": 2033,
      "WLGY": 2034,
      "GSH": 2035,
      "QPH": 2036,
      "HPP": 2037,
      "CLE": 2038,
      "HLPS": 2039,
      "KTA": 2040,
      "YFA": 2041,
      "HGD": 2042,
      "C(N)=O)": 2043,
      "PPLL": 2044,
      "ALVT": 2045,
      "TKN": 2046,
      "VCGD": 2047,
      "QGN": 2048,
      "PIA": 2049,
      "QDF": 2050,
      "n(C)": 2051,
      "RLF": 2052,
      "TVY": 2053,
      "IQA": 2054,
      "RVQ": 2055,
      "TEK": 2056,
      "QGA": 2057,
      "PEM": 2058,
      "DVD": 2059,
      "CGG": 2060,
      "QRS": 2061,
      "PYS": 2062,
      "DIF": 2063,
      "NGD": 2064,
      "DDY": 2065,
      "IGR": 2066,
      "GVH": 2067,
      "RPK": 2068,
      "DSGT": 2069,
      "KRL": 2070,
      "FKT": 2071,
      "LAIA": 2072,
      "GLM": 2073,
      "TRY": 2074,
      "MFTS": 2075,
      "VFGL": 2076,
      "DLN": 2077,
      "RFYF": 2078,
      "VDN": 2079,
      "MVE": 2080,
      "DEE": 2081,
      "CTAS": 2082,
      "EEW": 2083,
      "C(=O)NCC": 2084,
      "YIL": 2085,
      "LLQE": 2086,
      "GKW": 2087,
      "GGGA": 2088,
      "PRY": 2089,
      "GPN": 2090,
      "FLEE": 2091,
      "YGA": 2092,
      "C(CC1)": 2093,
      "c3cc(": 2094,
      "PVM": 2095,
      "C[C@H]1": 2096,
      "NVI": 2097,
      "KRN": 2098,
      "LLM": 2099,
      "TLY": 2100,
      "PTE": 2101,
      "HVV": 2102,
      "ccc23)": 2103,
      "KPI": 2104,
      "TNIY": 2105,
      "PAPA": 2106,
      "QVF": 2107,
      "CDS": 2108,
      "KVR": 2109,
      "LLLD": 2110,
      "PRN": 2111,
      "TII": 2112,
      "ISN": 2113,
      "QFY": 2114,
      "PQPP": 2115,
      "ncn": 2116,
      "MSS": 2117,
      "QLH": 2118,
      "TQK": 2119,
      "KAD": 2120,
      "PIH": 2121,
      "IGI": 2122,
      "KQD": 2123,
      "FFS": 2124,
      "DTE": 2125,
      "IAN": 2126,
      "KGN": 2127,
      "IAVC": 2128,
      "GDN": 2129,
      "YAE": 2130,
      "PLPS": 2131,
      "NLALA": 2132,
      "VVTL": 2133,
      "KKLS": 2134,
      "QVI": 2135,
      "QYE": 2136,
      "KPP": 2137,
      "FVD": 2138,
      "CN(CC": 2139,
      "VSLA": 2140,
      "DFE": 2141,
      "VLEA": 2142,
      "KRE": 2143,
      "GME": 2144,
      "RLN": 2145,
      "▁ML": 2146,
      "TTD": 2147,
      "YVI": 2148,
      "NC(=O)N": 2149,
      "TQA": 2150,
      "EEKK": 2151,
      "DAS": 2152,
      "YPD": 2153,
      "NLW": 2154,
      "FCS": 2155,
      "YVF": 2156,
      "SSVV": 2157,
      "QRF": 2158,
      "RKF": 2159,
      "YFS": 2160,
      "nc2": 2161,
      "PIY": 2162,
      "WLS": 2163,
      "MQA": 2164,
      "[C@H](C": 2165,
      "PYN": 2166,
      "QTP": 2167,
      "DSN": 2168,
      "ccc4": 2169,
      "CKN": 2170,
      "VEH": 2171,
      "TRK": 2172,
      "YGI": 2173,
      "GNVLVC": 2174,
      "DES": 2175,
      "KELL": 2176,
      "MII": 2177,
      "ENIL": 2178,
      "GTVY": 2179,
      "KFK": 2180,
      "cccc1": 2181,
      "MSVDRY": 2182,
      "YVN": 2183,
      "([O-])": 2184,
      "IGY": 2185,
      "TAF": 2186,
      "KFL": 2187,
      "QQM": 2188,
      "DLF": 2189,
      "PIN": 2190,
      "PSPS": 2191,
      "VSVL": 2192,
      "NVE": 2193,
      "VYM": 2194,
      "EIL": 2195,
      "TFY": 2196,
      "YGE": 2197,
      "C(N)=N)": 2198,
      "DVK": 2199,
      "TIM": 2200,
      "ALGL": 2201,
      "FGN": 2202,
      "CKT": 2203,
      "RPQ": 2204,
      "PPGT": 2205,
      "WNA": 2206,
      "NGI": 2207,
      "HGS": 2208,
      "PDLS": 2209,
      "QQE": 2210,
      "TRE": 2211,
      "KGQ": 2212,
      "ELD": 2213,
      "EKGE": 2214,
      "GHN": 2215,
      "GKN": 2216,
      "PYA": 2217,
      "PLW": 2218,
      "RNSS": 2219,
      "HVE": 2220,
      "WYW": 2221,
      "PESL": 2222,
      "FFD": 2223,
      "FMA": 2224,
      "QDE": 2225,
      "IPY": 2226,
      "KKM": 2227,
      "KLSS": 2228,
      "IGF": 2229,
      "ELVA": 2230,
      "FSM": 2231,
      "NGL": 2232,
      "NVK": 2233,
      "KPN": 2234,
      "DFGLARD": 2235,
      "ALSFV": 2236,
      "DIT": 2237,
      "YTT": 2238,
      "NNS": 2239,
      "HRDL": 2240,
      "MWE": 2241,
      "IPK": 2242,
      "IDC": 2243,
      "MIF": 2244,
      "GSSS": 2245,
      "THQS": 2246,
      "GSLA": 2247,
      "FRN": 2248,
      "ENFK": 2249,
      "HEK": 2250,
      "KEGK": 2251,
      "LAVV": 2252,
      "QIE": 2253,
      "c1ccc(O)": 2254,
      "VHL": 2255,
      "c1cccc(c1)": 2256,
      "PHA": 2257,
      "EAD": 2258,
      "▁CN(C)": 2259,
      "PCA": 2260,
      "PMS": 2261,
      "VLGS": 2262,
      "▁CN1CC": 2263,
      "IAY": 2264,
      "EYL": 2265,
      "FDL": 2266,
      "TLC": 2267,
      "RRIT": 2268,
      "EKL": 2269,
      "FIY": 2270,
      "WRE": 2271,
      "CID": 2272,
      "KQS": 2273,
      "QRD": 2274,
      "IRY": 2275,
      "GVR": 2276,
      "VATL": 2277,
      "GKVV": 2278,
      "KGG": 2279,
      "RLLL": 2280,
      "VWA": 2281,
      "YKI": 2282,
      "GAAA": 2283,
      "VLYEL": 2284,
      "HVL": 2285,
      "MDS": 2286,
      "LAD": 2287,
      "DALA": 2288,
      "WLL": 2289,
      "HQL": 2290,
      "HIL": 2291,
      "KNS": 2292,
      "QVK": 2293,
      "VHRDLAARNVL": 2294,
      "DLVQ": 2295,
      "RME": 2296,
      "C(=O)N[C@@H](C": 2297,
      "TQD": 2298,
      "PIP": 2299,
      "QHA": 2300,
      "PLVD": 2301,
      "TRN": 2302,
      "CCA": 2303,
      "FML": 2304,
      "YRK": 2305,
      "PGH": 2306,
      "CEGCKGF": 2307,
      "IGM": 2308,
      "GEC": 2309,
      "LLAIA": 2310,
      "KPQ": 2311,
      "c(O)": 2312,
      "MKK": 2313,
      "LAVADLL": 2314,
      "MPF": 2315,
      "TIP": 2316,
      "RRAL": 2317,
      "QLPA": 2318,
      "YKG": 2319,
      "IGK": 2320,
      "WKL": 2321,
      "MTS": 2322,
      "FDE": 2323,
      "-c1cc": 2324,
      "QLRK": 2325,
      "TPN": 2326,
      "YEA": 2327,
      "TIE": 2328,
      "KMA": 2329,
      "HKN": 2330,
      "FRT": 2331,
      "KRQ": 2332,
      "HFL": 2333,
      "HGT": 2334,
      "PLGL": 2335,
      "c1ncn": 2336,
      "QKC": 2337,
      "HGI": 2338,
      "KGW": 2339,
      "C(=O)N[C@@H](CC": 2340,
      "VYD": 2341,
      "GNY": 2342,
      "FGR": 2343,
      "RTE": 2344,
      "CAL": 2345,
      "TIN": 2346,
      "QHL": 2347,
      "KKDE": 2348,
      "QGC": 2349,
      "RIM": 2350,
      "TKE": 2351,
      "ENE": 2352,
      "CAIS": 2353,
      "QPR": 2354,
      "FHS": 2355,
      "YVE": 2356,
      "n1)": 2357,
      "MDF": 2358,
      "SLGI": 2359,
      "QRK": 2360,
      "RGH": 2361,
      "PYE": 2362,
      "GPGG": 2363,
      "MGE": 2364,
      "GKTL": 2365,
      "EEDS": 2366,
      "RLEE": 2367,
      "TRI": 2368,
      "YIE": 2369,
      "MGT": 2370,
      "GNLL": 2371,
      "DRE": 2372,
      "PPPE": 2373,
      "IFNLALA": 2374,
      "TNIYIFNLALA": 2375,
      "CGD": 2376,
      "YNMFTS": 2377,
      "VLRL": 2378,
      "IDYYNMFTS": 2379,
      "PALL": 2380,
      "PTSL": 2381,
      "HTL": 2382,
      "NPF": 2383,
      "RCA": 2384,
      "QMA": 2385,
      "cc(Cl)": 2386,
      "HVI": 2387,
      "KPK": 2388,
      "HRH": 2389,
      "WGP": 2390,
      "VIF": 2391,
      "VST": 2392,
      "QQLL": 2393,
      "MKTA": 2394,
      "KVA": 2395,
      "VAVF": 2396,
      "DGF": 2397,
      "TLPF": 2398,
      "HPA": 2399,
      "CQK": 2400,
      "CDF": 2401,
      "GQGT": 2402,
      "KIT": 2403,
      "YIT": 2404,
      "RRAA": 2405,
      "QPD": 2406,
      "MGM": 2407,
      "KVE": 2408,
      "KSLA": 2409,
      "GYLS": 2410,
      "DAHH": 2411,
      "IVIS": 2412,
      "GALL": 2413,
      "PYPGI": 2414,
      "MKT": 2415,
      "EDC": 2416,
      "DVWSFGVLLWE": 2417,
      "NKE": 2418,
      "QLVQ": 2419,
      "VSC": 2420,
      "GAAS": 2421,
      "4CC": 2422,
      "TNN": 2423,
      "FLHL": 2424,
      "TGQ": 2425,
      "INIC": 2426,
      "VKD": 2427,
      "YAFLD": 2428,
      "DDD": 2429,
      "HNA": 2430,
      "WED": 2431,
      "IFE": 2432,
      "CN1": 2433,
      "HFS": 2434,
      "GSRE": 2435,
      "QTS": 2436,
      "YES": 2437,
      "C[C@@H](": 2438,
      "FEN": 2439,
      "PGVS": 2440,
      "CVC": 2441,
      "GWN": 2442,
      "MVN": 2443,
      "PGY": 2444,
      "YIA": 2445,
      "KIQ": 2446,
      "MYE": 2447,
      "FIA": 2448,
      "KPR": 2449,
      "FLPS": 2450,
      "CN1CC": 2451,
      "c2cc1": 2452,
      "=C)": 2453,
      "PRK": 2454,
      "GSSL": 2455,
      "ncc1": 2456,
      "QLLL": 2457,
      "DPQ": 2458,
      "EEAS": 2459,
      "DWL": 2460,
      "RTLL": 2461,
      "RNK": 2462,
      "VIN": 2463,
      "FLVM": 2464,
      "ILLA": 2465,
      "TGSS": 2466,
      "RIE": 2467,
      "QIY": 2468,
      "C(=O)C": 2469,
      "TLH": 2470,
      "QPT": 2471,
      "KFY": 2472,
      "GLGG": 2473,
      "WKT": 2474,
      "DFL": 2475,
      "HIS": 2476,
      "TNQ": 2477,
      "MVV": 2478,
      "MLYN": 2479,
      "KNQ": 2480,
      "DCL": 2481,
      "FDA": 2482,
      "GCW": 2483,
      "VCLA": 2484,
      "GNIL": 2485,
      "QDD": 2486,
      "PIE": 2487,
      "GLPA": 2488,
      "GSGGS": 2489,
      "KLH": 2490,
      "IMN": 2491,
      "FIF": 2492,
      "TWL": 2493,
      "CII": 2494,
      "TLPD": 2495,
      "FIKLS": 2496,
      "GAT": 2497,
      "PGSS": 2498,
      "n2)": 2499,
      "MGG": 2500,
      "VLAS": 2501,
      "QAN": 2502,
      "WNIF": 2503,
      "IVG": 2504,
      "MVT": 2505,
      "PGSL": 2506,
      "GSGL": 2507,
      "KFN": 2508,
      "c23)": 2509,
      "DFRT": 2510,
      "THL": 2511,
      "NFS": 2512,
      "ETL": 2513,
      "FPGT": 2514,
      "DKS": 2515,
      "CRN": 2516,
      "cn1": 2517,
      "NC(=O)C": 2518,
      "VSH": 2519,
      "TTTN": 2520,
      "VHE": 2521,
      "YFN": 2522,
      "IDM": 2523,
      "EEAE": 2524,
      "KSW": 2525,
      "IAVCHP": 2526,
      "MSVDRYIAVCHP": 2527,
      "MSVDRYIAVCHPVKAL": 2528,
      "IME": 2529,
      "CTN": 2530,
      "IDYYNMFTSIFTL": 2531,
      "VGLS": 2532,
      "NRE": 2533,
      "FDSL": 2534,
      "IRI": 2535,
      "GSKK": 2536,
      "MSVDRYIAVCHPVKALDFRT": 2537,
      "QLSS": 2538,
      "cc(C)": 2539,
      "FAE": 2540,
      "KGD": 2541,
      "DIE": 2542,
      "RWS": 2543,
      "VQN": 2544,
      "SSKS": 2545,
      "c12)": 2546,
      "GIC": 2547,
      "c(N)": 2548,
      "GEW": 2549,
      "TDA": 2550,
      "PEVI": 2551,
      "PSAA": 2552,
      "PEYL": 2553,
      "RPGL": 2554,
      "RYH": 2555,
      "VSLS": 2556,
      "MGN": 2557,
      "ILTN": 2558,
      "ITN": 2559,
      "FEE": 2560,
      "PVR": 2561,
      "YSY": 2562,
      "DFVV": 2563,
      "YVQ": 2564,
      "c1ccc(Cl)cc1": 2565,
      "ALVL": 2566,
      "NWS": 2567,
      "RDN": 2568,
      "CTD": 2569,
      "TKMKTA": 2570,
      "TKMKTATNIYIFNLALA": 2571,
      "FLFW": 2572,
      "CFS": 2573,
      "▁CC1": 2574,
      "QALL": 2575,
      "KLIE": 2576,
      "CQL": 2577,
      "TSED": 2578,
      "CNC": 2579,
      "VGLL": 2580,
      "PWVV": 2581,
      "VAKQ": 2582,
      "FKS": 2583,
      "WTE": 2584,
      "PTN": 2585,
      "MTL": 2586,
      "YYN": 2587,
